Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL0.h
#define CLKCTL0_PSCCTL0_SET_CODE_CACHE_MASK      (0x2U)
#define CLKCTL0_PSCCTL0_SET_CODE_CACHE_SHIFT     (1U)
/*! CODE_CACHE - XCACHE1 (Code Cache) Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL0_SET_CODE_CACHE(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_CODE_CACHE_SHIFT)) & CLKCTL0_PSCCTL0_SET_CODE_CACHE_MASK)

#define CLKCTL0_PSCCTL0_SET_SYSTEM_CACHE_MASK    (0x4U)
#define CLKCTL0_PSCCTL0_SET_SYSTEM_CACHE_SHIFT   (2U)
/*! SYSTEM_CACHE - XCACHE0 (System Cache) Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL0_SET_SYSTEM_CACHE(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_SYSTEM_CACHE_SHIFT)) & CLKCTL0_PSCCTL0_SET_SYSTEM_CACHE_MASK)

#define CLKCTL0_PSCCTL0_SET_VDD2_OTP0_MASK       (0x20U)
#define CLKCTL0_PSCCTL0_SET_VDD2_OTP0_SHIFT      (5U)
/*! VDD2_OTP0 - VDD2_OTP_CTRL0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL0_SET_VDD2_OTP0(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_VDD2_OTP0_SHIFT)) & CLKCTL0_PSCCTL0_SET_VDD2_OTP0_MASK)

#define CLKCTL0_PSCCTL0_SET_SLEEPCON0_MASK       (0x1000U)
#define CLKCTL0_PSCCTL0_SET_SLEEPCON0_SHIFT      (12U)
/*! SLEEPCON0 - SLEEPCON0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL0_SET_SLEEPCON0(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_SLEEPCON0_SHIFT)) & CLKCTL0_PSCCTL0_SET_SLEEPCON0_MASK)

#define CLKCTL0_PSCCTL0_SET_SYSCON0_MASK         (0x2000U)
#define CLKCTL0_PSCCTL0_SET_SYSCON0_SHIFT        (13U)
/*! SYSCON0 - SYSCON0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL0_SET_SYSCON0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_SYSCON0_SHIFT)) & CLKCTL0_PSCCTL0_SET_SYSCON0_MASK)

#define CLKCTL0_PSCCTL0_SET_GLIKEY0_MASK         (0x4000U)
#define CLKCTL0_PSCCTL0_SET_GLIKEY0_SHIFT        (14U)
/*! GLIKEY0 - GLIKEY0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL0_SET_GLIKEY0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_GLIKEY0_SHIFT)) & CLKCTL0_PSCCTL0_SET_GLIKEY0_MASK)

#define CLKCTL0_PSCCTL0_SET_GLIKEY3_MASK         (0x8000U)
#define CLKCTL0_PSCCTL0_SET_GLIKEY3_SHIFT        (15U)
/*! GLIKEY3 - GLIKEY3 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL0_SET_GLIKEY3(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_GLIKEY3_SHIFT)) & CLKCTL0_PSCCTL0_SET_GLIKEY3_MASK)
/*! @} */

/*! @name PSCCTL1_SET - VDD2_COMP Peripheral Clock Control 1 Set */
/*! @{ */

#define CLKCTL0_PSCCTL1_SET_TPIU_TRACE_CLKIN_MASK (0x4U)
#define CLKCTL0_PSCCTL1_SET_TPIU_TRACE_CLKIN_SHIFT (2U)
/*! TPIU_TRACE_CLKIN - TPIU_TRACE_CLKIN (TRACE_RT700) Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_TPIU_TRACE_CLKIN(x)  (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_TPIU_TRACE_CLKIN_SHIFT)) & CLKCTL0_PSCCTL1_SET_TPIU_TRACE_CLKIN_MASK)

#define CLKCTL0_PSCCTL1_SET_SWO_TRACECLKIN_MASK  (0x8U)
#define CLKCTL0_PSCCTL1_SET_SWO_TRACECLKIN_SHIFT (3U)
/*! SWO_TRACECLKIN - SWO TRACECLKIN (TRACE_RT700) Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_SWO_TRACECLKIN(x)    (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_SWO_TRACECLKIN_SHIFT)) & CLKCTL0_PSCCTL1_SET_SWO_TRACECLKIN_MASK)

#define CLKCTL0_PSCCTL1_SET_TSCLK_MASK           (0x10U)
#define CLKCTL0_PSCCTL1_SET_TSCLK_SHIFT          (4U)
/*! TSCLK - TS (TRACE_RT700) Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_TSCLK(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_TSCLK_SHIFT)) & CLKCTL0_PSCCTL1_SET_TSCLK_MASK)

#define CLKCTL0_PSCCTL1_SET_EDMA0_MASK           (0x20U)
#define CLKCTL0_PSCCTL1_SET_EDMA0_SHIFT          (5U)
/*! eDMA0 - eDMA0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_EDMA0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_EDMA0_SHIFT)) & CLKCTL0_PSCCTL1_SET_EDMA0_MASK)

#define CLKCTL0_PSCCTL1_SET_EDMA1_MASK           (0x40U)
#define CLKCTL0_PSCCTL1_SET_EDMA1_SHIFT          (6U)
/*! eDMA1 - eDMA1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_EDMA1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_EDMA1_SHIFT)) & CLKCTL0_PSCCTL1_SET_EDMA1_MASK)

#define CLKCTL0_PSCCTL1_SET_PKC_RAM_CTRL_MASK    (0x80U)
#define CLKCTL0_PSCCTL1_SET_PKC_RAM_CTRL_SHIFT   (7U)
/*! PKC_RAM_CTRl - RAM Control Clock of PKC
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_PKC_RAM_CTRL(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_PKC_RAM_CTRL_SHIFT)) & CLKCTL0_PSCCTL1_SET_PKC_RAM_CTRL_MASK)

#define CLKCTL0_PSCCTL1_SET_PKC_MASK             (0x100U)
#define CLKCTL0_PSCCTL1_SET_PKC_SHIFT            (8U)
/*! PKC - PKC Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_PKC(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_PKC_SHIFT)) & CLKCTL0_PSCCTL1_SET_PKC_MASK)

#define CLKCTL0_PSCCTL1_SET_ROMCP_MASK           (0x200U)
#define CLKCTL0_PSCCTL1_SET_ROMCP_SHIFT          (9U)
/*! ROMCP - ROMCP Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_ROMCP(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_ROMCP_SHIFT)) & CLKCTL0_PSCCTL1_SET_ROMCP_MASK)

#define CLKCTL0_PSCCTL1_SET_XSPI0_MASK           (0x400U)
#define CLKCTL0_PSCCTL1_SET_XSPI0_SHIFT          (10U)
/*! XSPI0 - XSPI0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_XSPI0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_XSPI0_SHIFT)) & CLKCTL0_PSCCTL1_SET_XSPI0_MASK)

#define CLKCTL0_PSCCTL1_SET_XSPI1_MASK           (0x800U)
#define CLKCTL0_PSCCTL1_SET_XSPI1_SHIFT          (11U)
/*! XSPI1 - XSPI1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_XSPI1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_XSPI1_SHIFT)) & CLKCTL0_PSCCTL1_SET_XSPI1_MASK)

#define CLKCTL0_PSCCTL1_SET_CACHE64_0_MASK       (0x1000U)
#define CLKCTL0_PSCCTL1_SET_CACHE64_0_SHIFT      (12U)
/*! CACHE64_0 - CACHE64_0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_CACHE64_0(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_CACHE64_0_SHIFT)) & CLKCTL0_PSCCTL1_SET_CACHE64_0_MASK)

