Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL0.h
#define CLKCTL0_PSCCTL1_SET_CACHE64_1_MASK       (0x2000U)
#define CLKCTL0_PSCCTL1_SET_CACHE64_1_SHIFT      (13U)
/*! CACHE64_1 - CACHE64_1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_CACHE64_1(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_CACHE64_1_SHIFT)) & CLKCTL0_PSCCTL1_SET_CACHE64_1_MASK)

#define CLKCTL0_PSCCTL1_SET_QK_SUBSYS_MASK       (0x4000U)
#define CLKCTL0_PSCCTL1_SET_QK_SUBSYS_SHIFT      (14U)
/*! QK_SUBSYS - QK_SUBSYS (PUF_CTRL) Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_QK_SUBSYS(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_QK_SUBSYS_SHIFT)) & CLKCTL0_PSCCTL1_SET_QK_SUBSYS_MASK)

#define CLKCTL0_PSCCTL1_SET_MMU0_MASK            (0x10000U)
#define CLKCTL0_PSCCTL1_SET_MMU0_SHIFT           (16U)
/*! MMU0 - MMU0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_MMU0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_MMU0_SHIFT)) & CLKCTL0_PSCCTL1_SET_MMU0_MASK)

#define CLKCTL0_PSCCTL1_SET_MMU1_MASK            (0x20000U)
#define CLKCTL0_PSCCTL1_SET_MMU1_SHIFT           (17U)
/*! MMU1 - MMU1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_MMU1(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_MMU1_SHIFT)) & CLKCTL0_PSCCTL1_SET_MMU1_MASK)

#define CLKCTL0_PSCCTL1_SET_GPIO0_MASK           (0x40000U)
#define CLKCTL0_PSCCTL1_SET_GPIO0_SHIFT          (18U)
/*! GPIO0 - GPIO0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_GPIO0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_GPIO0_SHIFT)) & CLKCTL0_PSCCTL1_SET_GPIO0_MASK)

#define CLKCTL0_PSCCTL1_SET_GPIO1_MASK           (0x80000U)
#define CLKCTL0_PSCCTL1_SET_GPIO1_SHIFT          (19U)
/*! GPIO1 - GPIO1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_GPIO1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_GPIO1_SHIFT)) & CLKCTL0_PSCCTL1_SET_GPIO1_MASK)

#define CLKCTL0_PSCCTL1_SET_GPIO2_MASK           (0x100000U)
#define CLKCTL0_PSCCTL1_SET_GPIO2_SHIFT          (20U)
/*! GPIO2 - GPIO2 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_GPIO2(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_GPIO2_SHIFT)) & CLKCTL0_PSCCTL1_SET_GPIO2_MASK)

#define CLKCTL0_PSCCTL1_SET_GPIO3_MASK           (0x200000U)
#define CLKCTL0_PSCCTL1_SET_GPIO3_SHIFT          (21U)
/*! GPIO3 - GPIO3 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_GPIO3(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_GPIO3_SHIFT)) & CLKCTL0_PSCCTL1_SET_GPIO3_MASK)

#define CLKCTL0_PSCCTL1_SET_GPIO4_MASK           (0x400000U)
#define CLKCTL0_PSCCTL1_SET_GPIO4_SHIFT          (22U)
/*! GPIO4 - GPIO4 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_GPIO4(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_GPIO4_SHIFT)) & CLKCTL0_PSCCTL1_SET_GPIO4_MASK)

#define CLKCTL0_PSCCTL1_SET_GPIO5_MASK           (0x800000U)
#define CLKCTL0_PSCCTL1_SET_GPIO5_SHIFT          (23U)
/*! GPIO5 - GPIO5 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_GPIO5(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_GPIO5_SHIFT)) & CLKCTL0_PSCCTL1_SET_GPIO5_MASK)

#define CLKCTL0_PSCCTL1_SET_GPIO6_MASK           (0x1000000U)
#define CLKCTL0_PSCCTL1_SET_GPIO6_SHIFT          (24U)
/*! GPIO6 - GPIO6 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_GPIO6(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_GPIO6_SHIFT)) & CLKCTL0_PSCCTL1_SET_GPIO6_MASK)

#define CLKCTL0_PSCCTL1_SET_GPIO7_MASK           (0x2000000U)
#define CLKCTL0_PSCCTL1_SET_GPIO7_SHIFT          (25U)
/*! GPIO7 - GPIO7 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_GPIO7(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_GPIO7_SHIFT)) & CLKCTL0_PSCCTL1_SET_GPIO7_MASK)

#define CLKCTL0_PSCCTL1_SET_SCT0_MASK            (0x4000000U)
#define CLKCTL0_PSCCTL1_SET_SCT0_SHIFT           (26U)
/*! SCT0 - SCT0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_SCT0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_SCT0_SHIFT)) & CLKCTL0_PSCCTL1_SET_SCT0_MASK)

#define CLKCTL0_PSCCTL1_SET_CDOG0_MASK           (0x8000000U)
#define CLKCTL0_PSCCTL1_SET_CDOG0_SHIFT          (27U)
/*! CDOG0 - CDOG0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_CDOG0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_CDOG0_SHIFT)) & CLKCTL0_PSCCTL1_SET_CDOG0_MASK)

#define CLKCTL0_PSCCTL1_SET_CDOG1_MASK           (0x10000000U)
#define CLKCTL0_PSCCTL1_SET_CDOG1_SHIFT          (28U)
/*! CDOG1 - CDOG1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_CDOG1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_CDOG1_SHIFT)) & CLKCTL0_PSCCTL1_SET_CDOG1_MASK)

#define CLKCTL0_PSCCTL1_SET_CDOG2_MASK           (0x20000000U)
#define CLKCTL0_PSCCTL1_SET_CDOG2_SHIFT          (29U)
/*! CDOG2 - CDOG2 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_CDOG2(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_CDOG2_SHIFT)) & CLKCTL0_PSCCTL1_SET_CDOG2_MASK)

#define CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM0_MASK    (0x40000000U)
#define CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM0_SHIFT   (30U)
/*! LP_FLEXCOMM0 - LP_FLEXCOMM0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM0(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM0_SHIFT)) & CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM0_MASK)

#define CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM1_MASK    (0x80000000U)
#define CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM1_SHIFT   (31U)
/*! LP_FLEXCOMM1 - LP_FLEXCOMM1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM1(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM1_SHIFT)) & CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM1_MASK)
/*! @} */

/*! @name PSCCTL2_SET - VDD2_COMP Peripheral Clock Control 2 Set */
/*! @{ */

