Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL0.h
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM2_MASK    (0x1U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM2_SHIFT   (0U)
/*! LP_FLEXCOMM2 - LP_FLEXCOMM2 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM2(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM2_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM2_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM3_MASK    (0x2U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM3_SHIFT   (1U)
/*! LP_FLEXCOMM3 - LP_FLEXCOMM3 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM3(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM3_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM3_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM4_MASK    (0x4U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM4_SHIFT   (2U)
/*! LP_FLEXCOMM4 - LP_FLEXCOMM4 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM4(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM4_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM4_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM5_MASK    (0x8U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM5_SHIFT   (3U)
/*! LP_FLEXCOMM5 - LP_FLEXCOMM5 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM5(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM5_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM5_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM6_MASK    (0x10U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM6_SHIFT   (4U)
/*! LP_FLEXCOMM6 - LP_FLEXCOMM6 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM6(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM6_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM6_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM7_MASK    (0x20U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM7_SHIFT   (5U)
/*! LP_FLEXCOMM7 - LP_FLEXCOMM7 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM7(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM7_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM7_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM8_MASK    (0x40U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM8_SHIFT   (6U)
/*! LP_FLEXCOMM8 - LP_FLEXCOMM8 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM8(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM8_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM8_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM9_MASK    (0x80U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM9_SHIFT   (7U)
/*! LP_FLEXCOMM9 - LP_FLEXCOMM9 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM9(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM9_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM9_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM10_MASK   (0x100U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM10_SHIFT  (8U)
/*! LP_FLEXCOMM10 - LP_FLEXCOMM10 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM10(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM10_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM10_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM11_MASK   (0x200U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM11_SHIFT  (9U)
/*! LP_FLEXCOMM11 - LP_FLEXCOMM11 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM11(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM11_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM11_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM12_MASK   (0x400U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM12_SHIFT  (10U)
/*! LP_FLEXCOMM12 - LP_FLEXCOMM12 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM12(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM12_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM12_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM13_MASK   (0x800U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM13_SHIFT  (11U)
/*! LP_FLEXCOMM13 - LP_FLEXCOMM13 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM13(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM13_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM13_MASK)

#define CLKCTL0_PSCCTL2_SET_SAI0_MASK            (0x2000U)
#define CLKCTL0_PSCCTL2_SET_SAI0_SHIFT           (13U)
/*! SAI0 - SAI0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_SAI0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_SAI0_SHIFT)) & CLKCTL0_PSCCTL2_SET_SAI0_MASK)

#define CLKCTL0_PSCCTL2_SET_SAI1_MASK            (0x4000U)
#define CLKCTL0_PSCCTL2_SET_SAI1_SHIFT           (14U)
/*! SAI1 - SAI1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_SAI1(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_SAI1_SHIFT)) & CLKCTL0_PSCCTL2_SET_SAI1_MASK)

#define CLKCTL0_PSCCTL2_SET_SAI2_MASK            (0x8000U)
#define CLKCTL0_PSCCTL2_SET_SAI2_SHIFT           (15U)
/*! SAI2 - SAI2 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_SAI2(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_SAI2_SHIFT)) & CLKCTL0_PSCCTL2_SET_SAI2_MASK)

#define CLKCTL0_PSCCTL2_SET_I3C0_MASK            (0x10000U)
#define CLKCTL0_PSCCTL2_SET_I3C0_SHIFT           (16U)
/*! I3C0 - I3C0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_I3C0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_I3C0_SHIFT)) & CLKCTL0_PSCCTL2_SET_I3C0_MASK)

#define CLKCTL0_PSCCTL2_SET_I3C1_MASK            (0x20000U)
#define CLKCTL0_PSCCTL2_SET_I3C1_SHIFT           (17U)
/*! I3C1 - I3C1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_I3C1(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_I3C1_SHIFT)) & CLKCTL0_PSCCTL2_SET_I3C1_MASK)

#define CLKCTL0_PSCCTL2_SET_CRC0_MASK            (0x40000U)
#define CLKCTL0_PSCCTL2_SET_CRC0_SHIFT           (18U)
/*! CRC0 - CRC0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_CRC0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_CRC0_SHIFT)) & CLKCTL0_PSCCTL2_SET_CRC0_MASK)

#define CLKCTL0_PSCCTL2_SET_WWDT0_MASK           (0x80000U)
#define CLKCTL0_PSCCTL2_SET_WWDT0_SHIFT          (19U)
/*! WWDT0 - WWDT0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_WWDT0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_WWDT0_SHIFT)) & CLKCTL0_PSCCTL2_SET_WWDT0_MASK)

#define CLKCTL0_PSCCTL2_SET_WWDT1_MASK           (0x100000U)
#define CLKCTL0_PSCCTL2_SET_WWDT1_SHIFT          (20U)
/*! WWDT1 - WWDT1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_WWDT1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_WWDT1_SHIFT)) & CLKCTL0_PSCCTL2_SET_WWDT1_MASK)

#define CLKCTL0_PSCCTL2_SET_CTIMER0_MASK         (0x200000U)
#define CLKCTL0_PSCCTL2_SET_CTIMER0_SHIFT        (21U)
/*! CTIMER0 - CTIMER0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_CTIMER0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_CTIMER0_SHIFT)) & CLKCTL0_PSCCTL2_SET_CTIMER0_MASK)

#define CLKCTL0_PSCCTL2_SET_CTIMER1_MASK         (0x400000U)
#define CLKCTL0_PSCCTL2_SET_CTIMER1_SHIFT        (22U)
/*! CTIMER1 - CTIMER1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_CTIMER1(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_CTIMER1_SHIFT)) & CLKCTL0_PSCCTL2_SET_CTIMER1_MASK)

#define CLKCTL0_PSCCTL2_SET_CTIMER2_MASK         (0x800000U)
#define CLKCTL0_PSCCTL2_SET_CTIMER2_SHIFT        (23U)
/*! CTIMER2 - CTIMER2 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_CTIMER2(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_CTIMER2_SHIFT)) & CLKCTL0_PSCCTL2_SET_CTIMER2_MASK)

#define CLKCTL0_PSCCTL2_SET_CTIMER3_MASK         (0x1000000U)
#define CLKCTL0_PSCCTL2_SET_CTIMER3_SHIFT        (24U)
/*! CTIMER3 - CTIMER3 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_CTIMER3(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_CTIMER3_SHIFT)) & CLKCTL0_PSCCTL2_SET_CTIMER3_MASK)

#define CLKCTL0_PSCCTL2_SET_CTIMER4_MASK         (0x2000000U)
#define CLKCTL0_PSCCTL2_SET_CTIMER4_SHIFT        (25U)
/*! CTIMER4 - CTIMER4 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_CTIMER4(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_CTIMER4_SHIFT)) & CLKCTL0_PSCCTL2_SET_CTIMER4_MASK)

