Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL0.h
#define CLKCTL0_PSCCTL2_CLR_CTIMER3_MASK         (0x1000000U)
#define CLKCTL0_PSCCTL2_CLR_CTIMER3_SHIFT        (24U)
/*! CTIMER3 - CTIMER3 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL2_CLR_CTIMER3(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_CLR_CTIMER3_SHIFT)) & CLKCTL0_PSCCTL2_CLR_CTIMER3_MASK)

#define CLKCTL0_PSCCTL2_CLR_CTIMER4_MASK         (0x2000000U)
#define CLKCTL0_PSCCTL2_CLR_CTIMER4_SHIFT        (25U)
/*! CTIMER4 - CTIMER4 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL2_CLR_CTIMER4(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_CLR_CTIMER4_SHIFT)) & CLKCTL0_PSCCTL2_CLR_CTIMER4_MASK)

#define CLKCTL0_PSCCTL2_CLR_MRT0_MASK            (0x4000000U)
#define CLKCTL0_PSCCTL2_CLR_MRT0_SHIFT           (26U)
/*! MRT0 - MRT0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL2_CLR_MRT0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_CLR_MRT0_SHIFT)) & CLKCTL0_PSCCTL2_CLR_MRT0_MASK)

#define CLKCTL0_PSCCTL2_CLR_UTICK0_MASK          (0x8000000U)
#define CLKCTL0_PSCCTL2_CLR_UTICK0_SHIFT         (27U)
/*! UTICK0 - UTICK0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL2_CLR_UTICK0(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_CLR_UTICK0_SHIFT)) & CLKCTL0_PSCCTL2_CLR_UTICK0_MASK)

#define CLKCTL0_PSCCTL2_CLR_SEMA42_4_MASK        (0x40000000U)
#define CLKCTL0_PSCCTL2_CLR_SEMA42_4_SHIFT       (30U)
/*! SEMA42_4 - SEMA42_4 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL2_CLR_SEMA42_4(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_CLR_SEMA42_4_SHIFT)) & CLKCTL0_PSCCTL2_CLR_SEMA42_4_MASK)

#define CLKCTL0_PSCCTL2_CLR_MU4_MASK             (0x80000000U)
#define CLKCTL0_PSCCTL2_CLR_MU4_SHIFT            (31U)
/*! MU4 - MU4 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL2_CLR_MU4(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_CLR_MU4_SHIFT)) & CLKCTL0_PSCCTL2_CLR_MU4_MASK)
/*! @} */

/*! @name PSCCTL3_CLR - VDD2_COMP Peripheral Clock Control 3 Clear */
/*! @{ */

#define CLKCTL0_PSCCTL3_CLR_PINT0_MASK           (0x20U)
#define CLKCTL0_PSCCTL3_CLR_PINT0_SHIFT          (5U)
/*! PINT0 - PINT0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL3_CLR_PINT0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CLR_PINT0_SHIFT)) & CLKCTL0_PSCCTL3_CLR_PINT0_MASK)

#define CLKCTL0_PSCCTL3_CLR_PVTS0_MASK           (0x40U)
#define CLKCTL0_PSCCTL3_CLR_PVTS0_SHIFT          (6U)
/*! PVTS0 - PVTS0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL3_CLR_PVTS0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CLR_PVTS0_SHIFT)) & CLKCTL0_PSCCTL3_CLR_PVTS0_MASK)

#define CLKCTL0_PSCCTL3_CLR_FREQME0_MASK         (0x100U)
#define CLKCTL0_PSCCTL3_CLR_FREQME0_SHIFT        (8U)
/*! FREQME0 - FREQME0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL3_CLR_FREQME0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CLR_FREQME0_SHIFT)) & CLKCTL0_PSCCTL3_CLR_FREQME0_MASK)

#define CLKCTL0_PSCCTL3_CLR_INPUTMUX0_MASK       (0x400U)
#define CLKCTL0_PSCCTL3_CLR_INPUTMUX0_SHIFT      (10U)
/*! INPUTMUX0 - INPUTMUX0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL3_CLR_INPUTMUX0(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CLR_INPUTMUX0_SHIFT)) & CLKCTL0_PSCCTL3_CLR_INPUTMUX0_MASK)

#define CLKCTL0_PSCCTL3_CLR_SAFO_SGI_MASK        (0x1000U)
#define CLKCTL0_PSCCTL3_CLR_SAFO_SGI_SHIFT       (12U)
/*! SAFO_SGI - SAFO_SGI Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL3_CLR_SAFO_SGI(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CLR_SAFO_SGI_SHIFT)) & CLKCTL0_PSCCTL3_CLR_SAFO_SGI_MASK)

#define CLKCTL0_PSCCTL3_CLR_TRACE_MASK           (0x2000U)
#define CLKCTL0_PSCCTL3_CLR_TRACE_SHIFT          (13U)
/*! TRACE - TRACE Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL3_CLR_TRACE(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CLR_TRACE_SHIFT)) & CLKCTL0_PSCCTL3_CLR_TRACE_MASK)

#define CLKCTL0_PSCCTL3_CLR_PRINCE0_MASK         (0x8000U)
#define CLKCTL0_PSCCTL3_CLR_PRINCE0_SHIFT        (15U)
/*! PRINCE0 - PRINCE0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL3_CLR_PRINCE0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CLR_PRINCE0_SHIFT)) & CLKCTL0_PSCCTL3_CLR_PRINCE0_MASK)

#define CLKCTL0_PSCCTL3_CLR_PRINCE1_MASK         (0x10000U)
#define CLKCTL0_PSCCTL3_CLR_PRINCE1_SHIFT        (16U)
/*! PRINCE1 - PRINCE1 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL3_CLR_PRINCE1(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CLR_PRINCE1_SHIFT)) & CLKCTL0_PSCCTL3_CLR_PRINCE1_MASK)

#define CLKCTL0_PSCCTL3_CLR_XSPI1_PRINCE_XEX_MASK (0x20000U)
#define CLKCTL0_PSCCTL3_CLR_XSPI1_PRINCE_XEX_SHIFT (17U)
/*! XSPI1_PRINCE_XEX - XSPI1 PRINCE_XEX Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL3_CLR_XSPI1_PRINCE_XEX(x)  (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CLR_XSPI1_PRINCE_XEX_SHIFT)) & CLKCTL0_PSCCTL3_CLR_XSPI1_PRINCE_XEX_MASK)

#define CLKCTL0_PSCCTL3_CLR_CMX_PERFMON0_MASK    (0x40000U)
#define CLKCTL0_PSCCTL3_CLR_CMX_PERFMON0_SHIFT   (18U)
/*! CMX_PERFMON0 - CMX_PERFMON0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL3_CLR_CMX_PERFMON0(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CLR_CMX_PERFMON0_SHIFT)) & CLKCTL0_PSCCTL3_CLR_CMX_PERFMON0_MASK)

#define CLKCTL0_PSCCTL3_CLR_CMX_PERFMON1_MASK    (0x80000U)
#define CLKCTL0_PSCCTL3_CLR_CMX_PERFMON1_SHIFT   (19U)
/*! CMX_PERFMON1 - CMX_PERFMON1 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL3_CLR_CMX_PERFMON1(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CLR_CMX_PERFMON1_SHIFT)) & CLKCTL0_PSCCTL3_CLR_CMX_PERFMON1_MASK)
/*! @} */

/*! @name PSCCTL4_CLR - VDD2_COMP Peripheral Clock Control 4 Clear */
/*! @{ */

#define CLKCTL0_PSCCTL4_CLR_HIFI4_MASK           (0x1U)
#define CLKCTL0_PSCCTL4_CLR_HIFI4_SHIFT          (0U)
/*! HiFi4 - HiFi4 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL4_CLR_HIFI4(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL4_CLR_HIFI4_SHIFT)) & CLKCTL0_PSCCTL4_CLR_HIFI4_MASK)
/*! @} */

