Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL0.h
/*! @name PSCCTL5_CLR - VDD2_COMP Peripheral Clock Control 5 Clear */
/*! @{ */

#define CLKCTL0_PSCCTL5_CLR_NPU0_MASK            (0x1U)
#define CLKCTL0_PSCCTL5_CLR_NPU0_SHIFT           (0U)
/*! NPU0 - NPU0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL5_CLR_NPU0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL5_CLR_NPU0_SHIFT)) & CLKCTL0_PSCCTL5_CLR_NPU0_MASK)

#define CLKCTL0_PSCCTL5_CLR_COMP_ACCESS_RAM_ARBITER1_MASK (0x4U)
#define CLKCTL0_PSCCTL5_CLR_COMP_ACCESS_RAM_ARBITER1_SHIFT (2U)
/*! COMP_ACCESS_RAM_ARBITER1 - VDD2_COMP Access RAM Arbiter1 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL5_CLR_COMP_ACCESS_RAM_ARBITER1(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL5_CLR_COMP_ACCESS_RAM_ARBITER1_SHIFT)) & CLKCTL0_PSCCTL5_CLR_COMP_ACCESS_RAM_ARBITER1_MASK)

#define CLKCTL0_PSCCTL5_CLR_IOPCTL0_MASK         (0x8U)
#define CLKCTL0_PSCCTL5_CLR_IOPCTL0_SHIFT        (3U)
/*! IOPCTL0 - IOPCTL0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL5_CLR_IOPCTL0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL5_CLR_IOPCTL0_SHIFT)) & CLKCTL0_PSCCTL5_CLR_IOPCTL0_MASK)

#define CLKCTL0_PSCCTL5_CLR_HIFI4_ACCESS_RAM_ARBITER1_MASK (0x10U)
#define CLKCTL0_PSCCTL5_CLR_HIFI4_ACCESS_RAM_ARBITER1_SHIFT (4U)
/*! HiFi4_ACCESS_RAM_ARBITER1 - HiFi4 Access RAM Arbiter1 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL5_CLR_HIFI4_ACCESS_RAM_ARBITER1(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL5_CLR_HIFI4_ACCESS_RAM_ARBITER1_SHIFT)) & CLKCTL0_PSCCTL5_CLR_HIFI4_ACCESS_RAM_ARBITER1_MASK)

#define CLKCTL0_PSCCTL5_CLR_MEDIA_ACCESS_RAM_ARBITER0_MASK (0x20U)
#define CLKCTL0_PSCCTL5_CLR_MEDIA_ACCESS_RAM_ARBITER0_SHIFT (5U)
/*! MEDIA_ACCESS_RAM_ARBITER0 - VDD2_Media Access RAM Arbiter0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL5_CLR_MEDIA_ACCESS_RAM_ARBITER0(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL5_CLR_MEDIA_ACCESS_RAM_ARBITER0_SHIFT)) & CLKCTL0_PSCCTL5_CLR_MEDIA_ACCESS_RAM_ARBITER0_MASK)
/*! @} */

/*! @name ONE_SRC_CLKSLICE_ENABLE - One Source Clock Slice Enable */
/*! @{ */

#define CLKCTL0_ONE_SRC_CLKSLICE_ENABLE_DGDET0_FCLK_EN_MASK (0x1U)
#define CLKCTL0_ONE_SRC_CLKSLICE_ENABLE_DGDET0_FCLK_EN_SHIFT (0U)
/*! dGDET0_FCLK_EN - dGDET0 Functional Clock Enable
 *  0b0..Gates dGDET0 functional clock.
 *  0b1..Enables dGDET0 functional clock.
 */
#define CLKCTL0_ONE_SRC_CLKSLICE_ENABLE_DGDET0_FCLK_EN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_ONE_SRC_CLKSLICE_ENABLE_DGDET0_FCLK_EN_SHIFT)) & CLKCTL0_ONE_SRC_CLKSLICE_ENABLE_DGDET0_FCLK_EN_MASK)
/*! @} */

/*! @name FRO01CLKSTATUS - FRO_TUNER0 and FRO_TUNER1 Clock Status */
/*! @{ */

#define CLKCTL0_FRO01CLKSTATUS_FRO1_CLK_OK_MASK  (0x1U)
#define CLKCTL0_FRO01CLKSTATUS_FRO1_CLK_OK_SHIFT (0U)
/*! FRO1_CLK_OK - FRO_TUNER1 Clock OK
 *  0b0..FRO_TUNER1 clock has not yet reached its final frequency.
 *  0b1..FRO_TUNER1 clock has reached its final frequency.
 */
#define CLKCTL0_FRO01CLKSTATUS_FRO1_CLK_OK(x)    (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO01CLKSTATUS_FRO1_CLK_OK_SHIFT)) & CLKCTL0_FRO01CLKSTATUS_FRO1_CLK_OK_MASK)

#define CLKCTL0_FRO01CLKSTATUS_FRO0_CLK_OK_MASK  (0x2U)
#define CLKCTL0_FRO01CLKSTATUS_FRO0_CLK_OK_SHIFT (1U)
/*! FRO0_CLK_OK - FRO_TUNER0 Clock OK
 *  0b0..FRO_TUNER0 clock has not yet reached its final frequency.
 *  0b1..FRO_TUNER0 clock has reached its final frequency.
 */
#define CLKCTL0_FRO01CLKSTATUS_FRO0_CLK_OK(x)    (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO01CLKSTATUS_FRO0_CLK_OK_SHIFT)) & CLKCTL0_FRO01CLKSTATUS_FRO0_CLK_OK_MASK)
/*! @} */

/*! @name FRO0MAXDOMAINEN - FRO0MAX Clock Domain Enable */
/*! @{ */

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_CMPT_MASK (0x1U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_CMPT_SHIFT (0U)
/*! FRO0MAX_OF_CMPT - fro0_max Clock of VDD2_COMP
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_CMPT(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_CMPT_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_CMPT_MASK)

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_SENSE_MASK (0x2U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_SENSE_SHIFT (1U)
/*! FRO0MAX_OF_SENSE - fro0_max Clock of VDD1_SENSE Domain
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_SENSE(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_SENSE_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_SENSE_MASK)

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_DSP_MASK (0x4U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_DSP_SHIFT (2U)
/*! FRO0MAX_OF_VDD2_DSP - fro0_max Clock of VDD2_DSP Domain
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_DSP(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_DSP_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_DSP_MASK)

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MD2_MASK (0x8U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MD2_SHIFT (3U)
/*! FRO0MAX_OF_MD2 - fro0_max Clock of VDD2_MEDIA Domain
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MD2(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MD2_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MD2_MASK)

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MDN_MASK (0x10U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MDN_SHIFT (4U)
/*! FRO0MAX_OF_MDN - fro0_max Clock of VDDN_MEDIA Domain
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MDN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MDN_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MDN_MASK)

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_COM_MASK (0x20U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_COM_SHIFT (5U)
/*! FRO0MAX_OF_VDD2_COM - fro0_max Clock of VDD2_COM Domain
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_COM(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_COM_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_COM_MASK)

