Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL0.h
#define CLKCTL0_RAMCLKDIV_DIV_MASK               (0xFFU)
#define CLKCTL0_RAMCLKDIV_DIV_SHIFT              (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_RAMCLKDIV_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_RAMCLKDIV_DIV_SHIFT)) & CLKCTL0_RAMCLKDIV_DIV_MASK)

#define CLKCTL0_RAMCLKDIV_BUSY_MASK              (0x10000000U)
#define CLKCTL0_RAMCLKDIV_BUSY_SHIFT             (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_RAMCLKDIV_BUSY(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_RAMCLKDIV_BUSY_SHIFT)) & CLKCTL0_RAMCLKDIV_BUSY_MASK)

#define CLKCTL0_RAMCLKDIV_REQFLAG_MASK           (0x80000000U)
#define CLKCTL0_RAMCLKDIV_REQFLAG_SHIFT          (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_RAMCLKDIV_REQFLAG(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_RAMCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_RAMCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name TPIUFCLKSEL - TPIU (TRACE_RT700) Functional Clock Select Source */
/*! @{ */

#define CLKCTL0_TPIUFCLKSEL_SEL_MASK             (0x3U)
#define CLKCTL0_TPIUFCLKSEL_SEL_SHIFT            (0U)
/*! SEL - TPIU (TRACE_RT700) Clock Select Source
 *  0b00..baseclk_cmpt
 *  0b01..main_pll_pfd0
 *  0b10..fro0_max
 *  0b11..fro0_div6
 */
#define CLKCTL0_TPIUFCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUFCLKSEL_SEL_SHIFT)) & CLKCTL0_TPIUFCLKSEL_SEL_MASK)

#define CLKCTL0_TPIUFCLKSEL_SEL_EN_MASK          (0x4U)
#define CLKCTL0_TPIUFCLKSEL_SEL_EN_SHIFT         (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for TPIU clock.
 *  0b1..Enables mux output for TPIU clock.
 */
#define CLKCTL0_TPIUFCLKSEL_SEL_EN(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUFCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_TPIUFCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name TPIUCLKDIV - TPIU (TRACE_RT700) Functional Clock Divider */
/*! @{ */

#define CLKCTL0_TPIUCLKDIV_DIV_MASK              (0xFFU)
#define CLKCTL0_TPIUCLKDIV_DIV_SHIFT             (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_TPIUCLKDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUCLKDIV_DIV_SHIFT)) & CLKCTL0_TPIUCLKDIV_DIV_MASK)

#define CLKCTL0_TPIUCLKDIV_BUSY_MASK             (0x10000000U)
#define CLKCTL0_TPIUCLKDIV_BUSY_SHIFT            (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_TPIUCLKDIV_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUCLKDIV_BUSY_SHIFT)) & CLKCTL0_TPIUCLKDIV_BUSY_MASK)

#define CLKCTL0_TPIUCLKDIV_RESET_MASK            (0x20000000U)
#define CLKCTL0_TPIUCLKDIV_RESET_SHIFT           (29U)
/*! RESET - Reset Divider Counter
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL0_TPIUCLKDIV_RESET(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUCLKDIV_RESET_SHIFT)) & CLKCTL0_TPIUCLKDIV_RESET_MASK)

#define CLKCTL0_TPIUCLKDIV_HALT_MASK             (0x40000000U)
#define CLKCTL0_TPIUCLKDIV_HALT_SHIFT            (30U)
/*! HALT - Halt Divider Counter
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL0_TPIUCLKDIV_HALT(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUCLKDIV_HALT_SHIFT)) & CLKCTL0_TPIUCLKDIV_HALT_MASK)

#define CLKCTL0_TPIUCLKDIV_REQFLAG_MASK          (0x80000000U)
#define CLKCTL0_TPIUCLKDIV_REQFLAG_SHIFT         (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_TPIUCLKDIV_REQFLAG(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_TPIUCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name XSPI0FCLKSEL - XSPI0 Functional Clock Source Select */
/*! @{ */

#define CLKCTL0_XSPI0FCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL0_XSPI0FCLKSEL_SEL_SHIFT           (0U)
/*! SEL - XSPI0 Functional Clock Source Select
 *  0b00..baseclk_comn
 *  0b01..audio_pll_pfd0
 *  0b10..fro0_max
 *  0b11..main_pll_pfd1
 */
#define CLKCTL0_XSPI0FCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_XSPI0FCLKSEL_SEL_SHIFT)) & CLKCTL0_XSPI0FCLKSEL_SEL_MASK)

#define CLKCTL0_XSPI0FCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL0_XSPI0FCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for XSPI0 clock.
 *  0b1..Enables mux output for XSPI0 clock.
 */
#define CLKCTL0_XSPI0FCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_XSPI0FCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_XSPI0FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name XSPI0FCLKDIV - XSPI0 Functional Clock Divider */
/*! @{ */

#define CLKCTL0_XSPI0FCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL0_XSPI0FCLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_XSPI0FCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_XSPI0FCLKDIV_DIV_SHIFT)) & CLKCTL0_XSPI0FCLKDIV_DIV_MASK)

#define CLKCTL0_XSPI0FCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL0_XSPI0FCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_XSPI0FCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_XSPI0FCLKDIV_BUSY_SHIFT)) & CLKCTL0_XSPI0FCLKDIV_BUSY_MASK)

#define CLKCTL0_XSPI0FCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL0_XSPI0FCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_XSPI0FCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_XSPI0FCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_XSPI0FCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name XSPI1FCLKSEL - XSPI1 Functional Clock Select Source */
/*! @{ */

#define CLKCTL0_XSPI1FCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL0_XSPI1FCLKSEL_SEL_SHIFT           (0U)
/*! SEL - Select Clock Source
 *  0b00..baseclk_comn
 *  0b01..audio_pll_pfd1
 *  0b10..fro0_max
 *  0b11..main_pll_pfd2
 */
#define CLKCTL0_XSPI1FCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_XSPI1FCLKSEL_SEL_SHIFT)) & CLKCTL0_XSPI1FCLKSEL_SEL_MASK)

#define CLKCTL0_XSPI1FCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL0_XSPI1FCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for XSPI1 clock.
 *  0b1..Enables mux output for XSPI1 clock.
 */
#define CLKCTL0_XSPI1FCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_XSPI1FCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_XSPI1FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name XSPI1FCLKDIV - XSPI1 Functional Clock Divider */
/*! @{ */

#define CLKCTL0_XSPI1FCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL0_XSPI1FCLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_XSPI1FCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_XSPI1FCLKDIV_DIV_SHIFT)) & CLKCTL0_XSPI1FCLKDIV_DIV_MASK)

#define CLKCTL0_XSPI1FCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL0_XSPI1FCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_XSPI1FCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_XSPI1FCLKDIV_BUSY_SHIFT)) & CLKCTL0_XSPI1FCLKDIV_BUSY_MASK)

#define CLKCTL0_XSPI1FCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL0_XSPI1FCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_XSPI1FCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_XSPI1FCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_XSPI1FCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name SCTFCLKSEL - SCT Functional Clock Source Select */
/*! @{ */

#define CLKCTL0_SCTFCLKSEL_SEL_MASK              (0x3U)
#define CLKCTL0_SCTFCLKSEL_SEL_SHIFT             (0U)
/*! SEL - SCT Functional Clock Source Select
 *  0b00..baseclk_cmpt
 *  0b01..main_pll_pfd0
 *  0b10..fro0_max
 *  0b11..fro0_div6
 */
#define CLKCTL0_SCTFCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SCTFCLKSEL_SEL_SHIFT)) & CLKCTL0_SCTFCLKSEL_SEL_MASK)

