Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL0.h
#define CLKCTL0_SCTFCLKSEL_SEL_EN_MASK           (0x4U)
#define CLKCTL0_SCTFCLKSEL_SEL_EN_SHIFT          (2U)
/*! SEL_EN - Enable Clock Mux Output
 *  0b0..Gates mux output for SCT clock.
 *  0b1..Enables mux output for SCT clock.
 */
#define CLKCTL0_SCTFCLKSEL_SEL_EN(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SCTFCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_SCTFCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name SCTFCLKDIV - SCT Functional Clock Divider */
/*! @{ */

#define CLKCTL0_SCTFCLKDIV_DIV_MASK              (0xFFU)
#define CLKCTL0_SCTFCLKDIV_DIV_SHIFT             (0U)
/*! DIV - Clock Divider Value Selection */
#define CLKCTL0_SCTFCLKDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SCTFCLKDIV_DIV_SHIFT)) & CLKCTL0_SCTFCLKDIV_DIV_MASK)

#define CLKCTL0_SCTFCLKDIV_BUSY_MASK             (0x10000000U)
#define CLKCTL0_SCTFCLKDIV_BUSY_SHIFT            (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_SCTFCLKDIV_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SCTFCLKDIV_BUSY_SHIFT)) & CLKCTL0_SCTFCLKDIV_BUSY_MASK)

#define CLKCTL0_SCTFCLKDIV_RESET_MASK            (0x20000000U)
#define CLKCTL0_SCTFCLKDIV_RESET_SHIFT           (29U)
/*! RESET - Reset Divider Counter
 *  0b0..No effect
 *  0b1..Reset the divider counter
 */
#define CLKCTL0_SCTFCLKDIV_RESET(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SCTFCLKDIV_RESET_SHIFT)) & CLKCTL0_SCTFCLKDIV_RESET_MASK)

#define CLKCTL0_SCTFCLKDIV_HALT_MASK             (0x40000000U)
#define CLKCTL0_SCTFCLKDIV_HALT_SHIFT            (30U)
/*! HALT - Halt Divider Counter
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL0_SCTFCLKDIV_HALT(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SCTFCLKDIV_HALT_SHIFT)) & CLKCTL0_SCTFCLKDIV_HALT_MASK)

#define CLKCTL0_SCTFCLKDIV_REQFLAG_MASK          (0x80000000U)
#define CLKCTL0_SCTFCLKDIV_REQFLAG_SHIFT         (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_SCTFCLKDIV_REQFLAG(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SCTFCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_SCTFCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name UTICK0FCLKSEL - UTICK0 Functional Clock Select Source */
/*! @{ */

#define CLKCTL0_UTICK0FCLKSEL_SEL_MASK           (0x3U)
#define CLKCTL0_UTICK0FCLKSEL_SEL_SHIFT          (0U)
/*! SEL - Select Clock Source
 *  0b00..baseclk_cmpt
 *  0b01..1m_lposc
 *  0b10..fro0_max
 *  0b11..fro1_div2
 */
#define CLKCTL0_UTICK0FCLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_UTICK0FCLKSEL_SEL_SHIFT)) & CLKCTL0_UTICK0FCLKSEL_SEL_MASK)

#define CLKCTL0_UTICK0FCLKSEL_SEL_EN_MASK        (0x4U)
#define CLKCTL0_UTICK0FCLKSEL_SEL_EN_SHIFT       (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for UTICK0 clock.
 *  0b1..Enables mux output for UTICK0 clock.
 */
#define CLKCTL0_UTICK0FCLKSEL_SEL_EN(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_UTICK0FCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_UTICK0FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name UTICK0FCLKDIV - UTICK0 Functional Clock Divider */
/*! @{ */

#define CLKCTL0_UTICK0FCLKDIV_DIV_MASK           (0xFFU)
#define CLKCTL0_UTICK0FCLKDIV_DIV_SHIFT          (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_UTICK0FCLKDIV_DIV(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_UTICK0FCLKDIV_DIV_SHIFT)) & CLKCTL0_UTICK0FCLKDIV_DIV_MASK)

#define CLKCTL0_UTICK0FCLKDIV_BUSY_MASK          (0x10000000U)
#define CLKCTL0_UTICK0FCLKDIV_BUSY_SHIFT         (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_UTICK0FCLKDIV_BUSY(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_UTICK0FCLKDIV_BUSY_SHIFT)) & CLKCTL0_UTICK0FCLKDIV_BUSY_MASK)

#define CLKCTL0_UTICK0FCLKDIV_RESET_MASK         (0x20000000U)
#define CLKCTL0_UTICK0FCLKDIV_RESET_SHIFT        (29U)
/*! RESET - Reset Divider Counter
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL0_UTICK0FCLKDIV_RESET(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_UTICK0FCLKDIV_RESET_SHIFT)) & CLKCTL0_UTICK0FCLKDIV_RESET_MASK)

#define CLKCTL0_UTICK0FCLKDIV_HALT_MASK          (0x40000000U)
#define CLKCTL0_UTICK0FCLKDIV_HALT_SHIFT         (30U)
/*! HALT - Halt Divider Counter
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL0_UTICK0FCLKDIV_HALT(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_UTICK0FCLKDIV_HALT_SHIFT)) & CLKCTL0_UTICK0FCLKDIV_HALT_MASK)

#define CLKCTL0_UTICK0FCLKDIV_REQFLAG_MASK       (0x80000000U)
#define CLKCTL0_UTICK0FCLKDIV_REQFLAG_SHIFT      (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_UTICK0FCLKDIV_REQFLAG(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_UTICK0FCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_UTICK0FCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name WWDT0FCLKSEL - WWDT0 Functional Clock Source Select */
/*! @{ */

#define CLKCTL0_WWDT0FCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL0_WWDT0FCLKSEL_SEL_SHIFT           (0U)
/*! SEL - Select Clock Source
 *  0b00..1m_lposc
 *  0b01..Reserved
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define CLKCTL0_WWDT0FCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_WWDT0FCLKSEL_SEL_SHIFT)) & CLKCTL0_WWDT0FCLKSEL_SEL_MASK)

#define CLKCTL0_WWDT0FCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL0_WWDT0FCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Enable Clock Mux Output
 *  0b0..Gates mux output for WWDT0 clock.
 *  0b1..Enables mux output for WWDT0 clock.
 */
#define CLKCTL0_WWDT0FCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_WWDT0FCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_WWDT0FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name WWDT1FCLKSEL - WWDT1 Functional Clock Source Select */
/*! @{ */

#define CLKCTL0_WWDT1FCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL0_WWDT1FCLKSEL_SEL_SHIFT           (0U)
/*! SEL - WWDT1 Functional Clock Source Select
 *  0b00..1m_lposc
 *  0b01..Reserved
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define CLKCTL0_WWDT1FCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_WWDT1FCLKSEL_SEL_SHIFT)) & CLKCTL0_WWDT1FCLKSEL_SEL_MASK)

#define CLKCTL0_WWDT1FCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL0_WWDT1FCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Enable Clock Mux Output
 *  0b0..Gates mux output for WWDT1 clock.
 *  0b1..Enables mux output for WWDT1 clock.
 */
#define CLKCTL0_WWDT1FCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_WWDT1FCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_WWDT1FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name SYSTICKFCLKSEL - SYSTICK Functional Clock Source Select */
/*! @{ */

#define CLKCTL0_SYSTICKFCLKSEL_SEL_MASK          (0x3U)
#define CLKCTL0_SYSTICKFCLKSEL_SEL_SHIFT         (0U)
/*! SEL - Select Clock Source for SYSTICK
 *  0b00..baseclk_cmpt
 *  0b01..1m_lposc
 *  0b10..wake32k_clk (switch to other clock source before VDD2_COMP enters into the Deep Sleep Retention mode.)
 *  0b11..osc_clk
 */
#define CLKCTL0_SYSTICKFCLKSEL_SEL(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSTICKFCLKSEL_SEL_SHIFT)) & CLKCTL0_SYSTICKFCLKSEL_SEL_MASK)

#define CLKCTL0_SYSTICKFCLKSEL_SEL_EN_MASK       (0x4U)
#define CLKCTL0_SYSTICKFCLKSEL_SEL_EN_SHIFT      (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for SYSTICK clock.
 *  0b1..Enables mux output for SYSTICK clock.
 */
#define CLKCTL0_SYSTICKFCLKSEL_SEL_EN(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSTICKFCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_SYSTICKFCLKSEL_SEL_EN_MASK)
/*! @} */

