Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL0.h
/*! @name SYSTICKFCLKDIV - SYSTICK Functional Clock Divider */
/*! @{ */

#define CLKCTL0_SYSTICKFCLKDIV_DIV_MASK          (0xFFU)
#define CLKCTL0_SYSTICKFCLKDIV_DIV_SHIFT         (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_SYSTICKFCLKDIV_DIV(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSTICKFCLKDIV_DIV_SHIFT)) & CLKCTL0_SYSTICKFCLKDIV_DIV_MASK)

#define CLKCTL0_SYSTICKFCLKDIV_BUSY_MASK         (0x10000000U)
#define CLKCTL0_SYSTICKFCLKDIV_BUSY_SHIFT        (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_SYSTICKFCLKDIV_BUSY(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSTICKFCLKDIV_BUSY_SHIFT)) & CLKCTL0_SYSTICKFCLKDIV_BUSY_MASK)

#define CLKCTL0_SYSTICKFCLKDIV_RESET_MASK        (0x20000000U)
#define CLKCTL0_SYSTICKFCLKDIV_RESET_SHIFT       (29U)
/*! RESET - Reset Divider Counter
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL0_SYSTICKFCLKDIV_RESET(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSTICKFCLKDIV_RESET_SHIFT)) & CLKCTL0_SYSTICKFCLKDIV_RESET_MASK)

#define CLKCTL0_SYSTICKFCLKDIV_HALT_MASK         (0x40000000U)
#define CLKCTL0_SYSTICKFCLKDIV_HALT_SHIFT        (30U)
/*! HALT - Halt Divider Counter
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL0_SYSTICKFCLKDIV_HALT(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSTICKFCLKDIV_HALT_SHIFT)) & CLKCTL0_SYSTICKFCLKDIV_HALT_MASK)

#define CLKCTL0_SYSTICKFCLKDIV_REQFLAG_MASK      (0x80000000U)
#define CLKCTL0_SYSTICKFCLKDIV_REQFLAG_SHIFT     (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_SYSTICKFCLKDIV_REQFLAG(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSTICKFCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_SYSTICKFCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name FCCLKSEL - LP_FLEXCOMM 0 to 13 Clock Source 0 Select..LP_FLEXCOMM 0 to 13 Clock Source 3 Select */
/*! @{ */

#define CLKCTL0_FCCLKSEL_SEL_MASK                (0x3U)
#define CLKCTL0_FCCLKSEL_SEL_SHIFT               (0U)
/*! SEL - LP_FLEXCOMM 0 to 13 Source Clock 3 Select
 *  0b00..baseclk_cmpt
 *  0b01..fro0_max
 *  0b10..main_pll_pfd3
 *  0b11..osc_clk
 */
#define CLKCTL0_FCCLKSEL_SEL(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FCCLKSEL_SEL_SHIFT)) & CLKCTL0_FCCLKSEL_SEL_MASK)

#define CLKCTL0_FCCLKSEL_SEL_EN_MASK             (0x4U)
#define CLKCTL0_FCCLKSEL_SEL_EN_SHIFT            (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for FC clock 0.
 *  0b1..Enables mux output for FC clock 0.
 */
#define CLKCTL0_FCCLKSEL_SEL_EN(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FCCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_FCCLKSEL_SEL_EN_MASK)
/*! @} */

/* The count of CLKCTL0_FCCLKSEL */
#define CLKCTL0_FCCLKSEL_COUNT                   (14U)

/*! @name FCCLKDIV - LP_FLEXCOMM 0 to 13 Clock Source 0 Divider..LP_FLEXCOMM 0 to 13 Clock Source 3 Divider */
/*! @{ */

#define CLKCTL0_FCCLKDIV_DIV_MASK                (0xFFU)
#define CLKCTL0_FCCLKDIV_DIV_SHIFT               (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_FCCLKDIV_DIV(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FCCLKDIV_DIV_SHIFT)) & CLKCTL0_FCCLKDIV_DIV_MASK)

#define CLKCTL0_FCCLKDIV_BUSY_MASK               (0x10000000U)
#define CLKCTL0_FCCLKDIV_BUSY_SHIFT              (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_FCCLKDIV_BUSY(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FCCLKDIV_BUSY_SHIFT)) & CLKCTL0_FCCLKDIV_BUSY_MASK)

#define CLKCTL0_FCCLKDIV_RESET_MASK              (0x20000000U)
#define CLKCTL0_FCCLKDIV_RESET_SHIFT             (29U)
/*! RESET - Reset Divider Counter
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL0_FCCLKDIV_RESET(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FCCLKDIV_RESET_SHIFT)) & CLKCTL0_FCCLKDIV_RESET_MASK)

#define CLKCTL0_FCCLKDIV_HALT_MASK               (0x40000000U)
#define CLKCTL0_FCCLKDIV_HALT_SHIFT              (30U)
/*! HALT - Halt Divider Counter
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL0_FCCLKDIV_HALT(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FCCLKDIV_HALT_SHIFT)) & CLKCTL0_FCCLKDIV_HALT_MASK)

#define CLKCTL0_FCCLKDIV_REQFLAG_MASK            (0x80000000U)
#define CLKCTL0_FCCLKDIV_REQFLAG_SHIFT           (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_FCCLKDIV_REQFLAG(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FCCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_FCCLKDIV_REQFLAG_MASK)
/*! @} */

/* The count of CLKCTL0_FCCLKDIV */
#define CLKCTL0_FCCLKDIV_COUNT                   (14U)

/*! @name FCFCLKSEL - LP_FLEXCOMM0 Clock Source Select..LP_FLEXCOMM13 Clock Source Select */
/*! @{ */

#define CLKCTL0_FCFCLKSEL_SEL_MASK               (0x3U)
#define CLKCTL0_FCFCLKSEL_SEL_SHIFT              (0U)
/*! SEL - LP_FLEXCOMM Functional Clock Source Select
 *  0b00..fcclk0
 *  0b01..fcclk1
 *  0b10..fcclk2
 *  0b11..fcclk3
 */
#define CLKCTL0_FCFCLKSEL_SEL(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FCFCLKSEL_SEL_SHIFT)) & CLKCTL0_FCFCLKSEL_SEL_MASK)

#define CLKCTL0_FCFCLKSEL_SEL_EN_MASK            (0x4U)
#define CLKCTL0_FCFCLKSEL_SEL_EN_SHIFT           (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for LP_FLEXCOMM10 clock.
 *  0b1..Enables mux output for LP_FLEXCOMM10 clock.
 */
#define CLKCTL0_FCFCLKSEL_SEL_EN(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FCFCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_FCFCLKSEL_SEL_EN_MASK)
/*! @} */

/* The count of CLKCTL0_FCFCLKSEL */
#define CLKCTL0_FCFCLKSEL_COUNT                  (14U)

/*! @name SAI012FCLKSEL - SAI0, SAI1 and SAI2 Clock Source Select */
/*! @{ */

