Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL0.h
#define CLKCTL0_SAI012FCLKSEL_SEL_MASK           (0x3U)
#define CLKCTL0_SAI012FCLKSEL_SEL_SHIFT          (0U)
/*! SEL - SAI0, SAI1 and SAI2 Clock Source Select
 *  0b00..baseclk_cmpt
 *  0b01..fro2_div8
 *  0b10..fro0_max
 *  0b11..audio_clk_cmpt
 */
#define CLKCTL0_SAI012FCLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SAI012FCLKSEL_SEL_SHIFT)) & CLKCTL0_SAI012FCLKSEL_SEL_MASK)

#define CLKCTL0_SAI012FCLKSEL_SEL_EN_MASK        (0x4U)
#define CLKCTL0_SAI012FCLKSEL_SEL_EN_SHIFT       (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for SAI0, SAI1 and SAI2 clocks.
 *  0b1..Enables mux output for SAI0, SAI1 and SAI2 clocks.
 */
#define CLKCTL0_SAI012FCLKSEL_SEL_EN(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SAI012FCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_SAI012FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name SAI012CLKDIV - SAI0, SAI1 and SAI2 Functional Clock Divider */
/*! @{ */

#define CLKCTL0_SAI012CLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL0_SAI012CLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_SAI012CLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SAI012CLKDIV_DIV_SHIFT)) & CLKCTL0_SAI012CLKDIV_DIV_MASK)

#define CLKCTL0_SAI012CLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL0_SAI012CLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_SAI012CLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SAI012CLKDIV_BUSY_SHIFT)) & CLKCTL0_SAI012CLKDIV_BUSY_MASK)

#define CLKCTL0_SAI012CLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL0_SAI012CLKDIV_RESET_SHIFT         (29U)
/*! RESET - Reset Divider Counter
 *  0b0..No effect
 *  0b1..Reset the divider counter.
 */
#define CLKCTL0_SAI012CLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SAI012CLKDIV_RESET_SHIFT)) & CLKCTL0_SAI012CLKDIV_RESET_MASK)

#define CLKCTL0_SAI012CLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL0_SAI012CLKDIV_HALT_SHIFT          (30U)
/*! HALT - Halt Divider Counter
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL0_SAI012CLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SAI012CLKDIV_HALT_SHIFT)) & CLKCTL0_SAI012CLKDIV_HALT_MASK)

#define CLKCTL0_SAI012CLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL0_SAI012CLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_SAI012CLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SAI012CLKDIV_REQFLAG_SHIFT)) & CLKCTL0_SAI012CLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name CTIMERCLKDIV - CTIMER0 Functional Clock Divider..CTIMER4 Functional Clock Divider */
/*! @{ */

#define CLKCTL0_CTIMERCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL0_CTIMERCLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_CTIMERCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CTIMERCLKDIV_DIV_SHIFT)) & CLKCTL0_CTIMERCLKDIV_DIV_MASK)

#define CLKCTL0_CTIMERCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL0_CTIMERCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_CTIMERCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CTIMERCLKDIV_BUSY_SHIFT)) & CLKCTL0_CTIMERCLKDIV_BUSY_MASK)

#define CLKCTL0_CTIMERCLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL0_CTIMERCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Reset Divider Counter
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL0_CTIMERCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CTIMERCLKDIV_RESET_SHIFT)) & CLKCTL0_CTIMERCLKDIV_RESET_MASK)

#define CLKCTL0_CTIMERCLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL0_CTIMERCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Halt Divider Counter
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL0_CTIMERCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CTIMERCLKDIV_HALT_SHIFT)) & CLKCTL0_CTIMERCLKDIV_HALT_MASK)

#define CLKCTL0_CTIMERCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL0_CTIMERCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_CTIMERCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CTIMERCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_CTIMERCLKDIV_REQFLAG_MASK)
/*! @} */

/* The count of CLKCTL0_CTIMERCLKDIV */
#define CLKCTL0_CTIMERCLKDIV_COUNT               (5U)

/*! @name CTIMERFCLKSEL - CTIMER0 Functional Clock Source Select..CTIMER4 Functional Clock Source Select */
/*! @{ */

#define CLKCTL0_CTIMERFCLKSEL_SEL_MASK           (0x3U)
#define CLKCTL0_CTIMERFCLKSEL_SEL_SHIFT          (0U)
/*! SEL - CTIMER4 Functional Clock Source Select
 *  0b00..baseclk_cmpt
 *  0b01..audio_clk_cmpt
 *  0b10..fro0_max
 *  0b11..wake32k_clk
 */
#define CLKCTL0_CTIMERFCLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CTIMERFCLKSEL_SEL_SHIFT)) & CLKCTL0_CTIMERFCLKSEL_SEL_MASK)

#define CLKCTL0_CTIMERFCLKSEL_SEL_EN_MASK        (0x4U)
#define CLKCTL0_CTIMERFCLKSEL_SEL_EN_SHIFT       (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for CTIMER0 clock.
 *  0b1..Enables mux output for CTIMER0 clock.
 */
#define CLKCTL0_CTIMERFCLKSEL_SEL_EN(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CTIMERFCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_CTIMERFCLKSEL_SEL_EN_MASK)
/*! @} */

/* The count of CLKCTL0_CTIMERFCLKSEL */
#define CLKCTL0_CTIMERFCLKSEL_COUNT              (5U)

/*! @name TRNGFCLKSEL - TRNG Functional Clock Source Select */
/*! @{ */

#define CLKCTL0_TRNGFCLKSEL_SEL_MASK             (0x3U)
#define CLKCTL0_TRNGFCLKSEL_SEL_SHIFT            (0U)
/*! SEL - TRNG Functional Clock Source Select
 *  0b00..baseclk_cmpt
 *  0b01..fro1_div2
 *  0b10..fro1_div8
 *  0b11..fro1_div3
 */
#define CLKCTL0_TRNGFCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TRNGFCLKSEL_SEL_SHIFT)) & CLKCTL0_TRNGFCLKSEL_SEL_MASK)

